{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_9","layers":[{"class_name":"Dense","config":{"units":22,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true,"batch_input_shape":[null,71],"dtype":"float32"}},{"class_name":"Dense","config":{"units":11,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense29/kernel","shape":[71,22],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[22],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[22,11],"dtype":"float32"},{"name":"dense_Dense30/bias","shape":[11],"dtype":"float32"},{"name":"dense_Dense31/kernel","shape":[11,5],"dtype":"float32"},{"name":"dense_Dense31/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense32/kernel","shape":[5,4],"dtype":"float32"},{"name":"dense_Dense32/bias","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}