{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_26","layers":[{"class_name":"Dense","config":{"units":15,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense86","trainable":true,"batch_input_shape":[null,37],"dtype":"float32"}},{"class_name":"Dense","config":{"units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense87","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense88","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense86/kernel","shape":[37,15],"dtype":"float32"},{"name":"dense_Dense86/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense87/kernel","shape":[15,10],"dtype":"float32"},{"name":"dense_Dense87/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense88/kernel","shape":[10,4],"dtype":"float32"},{"name":"dense_Dense88/bias","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}