{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_24","layers":[{"class_name":"Dense","config":{"units":18,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense82","trainable":true,"batch_input_shape":[null,59],"dtype":"float32"}},{"class_name":"Dense","config":{"units":12,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense83","trainable":true}},{"class_name":"Dense","config":{"units":6,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense84","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense85","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense82/kernel","shape":[59,18],"dtype":"float32"},{"name":"dense_Dense82/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense83/kernel","shape":[18,12],"dtype":"float32"},{"name":"dense_Dense83/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense84/kernel","shape":[12,6],"dtype":"float32"},{"name":"dense_Dense84/bias","shape":[6],"dtype":"float32"},{"name":"dense_Dense85/kernel","shape":[6,4],"dtype":"float32"},{"name":"dense_Dense85/bias","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}